## Desafío

Eliminar registros duplicados.

## Librerías

In [1]:
import pandas as pd

## Lectura de datos

In [2]:
df = pd.read_csv('empleados.csv', sep=';')
df.head()

,Nombre,Apellido,Sexo,Estado_Civil,Edad,Experiencia,Salario,Gerencia,Departamento
0,Alexandro,NaN,Masculino,Soltero(a),22.0,3.0,2423.0,No,Publicidad
1,Carlos,NaN,Masculino,Casado(a),38.0,10.0,3132.0,Sí,NaN
2,Felipa,NaN,Femenino,Soltero(a),26.0,5.0,2639.0,No,Comercial
3,Daniel,NaN,Masculino,Casado(a),35.0,10.0,3122.0,No,Comercial
4,John,NaN,Masculino,Casado(a),35.0,13.0,3431.0,Sí,Servicios al cliente

In [3]:
df = df.drop('Apellido', axis=1)
df.dropna(inplace=True)
df.shape

(145, 8)

## Solución

In [4]:
# Número de registros duplicados
df.duplicated().sum()

2

In [5]:
# Veamos los registros duplicados
df[df.duplicated()]

,Nombre,Sexo,Estado_Civil,Edad,Experiencia,Salario,Gerencia,Departamento
14,Selena,Femenino,Casado(a),24.0,6.0,2709.0,Sí,Contabilidad
65,Lucio,Masculino,Soltero(a),54.0,12.0,3317.0,No,Recursos Humanos

In [6]:
# Eliminamos los registros duplicados
df.drop_duplicates(inplace=True)

In [7]:
# Verificamos que no hayan registros duplicados
df.duplicated().sum()

0